app/views/polls/show.html.erb

<%= link_to 'Back', polls_path %>
<% @poll.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."poll_id" = ?  [["poll_id", 1]]