app/controllers/polls_controller.rb

  def index
    @polls = Poll.all
---
SELECT "polls".* FROM "polls"

  def create
    @poll = Poll.new(poll_params)
    @poll.admin_id = session[:user].id

    respond_to do |format|
      if @poll.save
---
INSERT INTO "polls" ("admin_id", "created_at", "deadline", "question", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

def notify_users
 Voter.where('approved = ?', true).each do |voter|
---
SELECT "voters".* FROM "voters" WHERE (approved = 't')

  def update
    respond_to do |format|
      if @poll.update(poll_params)
---
UPDATE "polls" SET "question" = ?, "deadline" = ?, "updated_at" = ? WHERE "polls"."id" = 2  [["question", "what time should be in for sessions?"], ["deadline", Thu, 30 Oct 2014 10:30:00 UTC +00:00], ["updated_at", Wed, 06 Nov 2013 15:06:49 UTC +00:00]]

  def destroy
    @poll.destroy
---
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]

    def set_poll
      @poll = Poll.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "3"]]