app/controllers/voters_controller.rb

SELECT "voters".* FROM "voters"
---
  def index
    @voters = Voter.all