app/controllers/voters_controller.rb

  def index
    if  !view_context.admin_is_logged_in?
      redirect_to new_session_path
    else
      @voters = Voter.all.order("approved")
---
SELECT "voters".* FROM "voters" ORDER BY approved

  def create
    @voter = Voter.new(voter_params)

    respond_to do |format|
      if @voter.save
---
INSERT INTO "voters" ("created_at", "email", "password", "phone", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 17 Oct 2013 13:01:39 UTC +00:00], ["email", "hfrddsr"], ["password", "jgff"], ["phone", "65544"], ["updated_at", Thu, 17 Oct 2013 13:01:39 UTC +00:00], ["username", "jgftr"]]

  def update
    respond_to do |format|
      if @voter.update(voter_params)
---
UPDATE "voters" SET "password" = ?, "approved" = ?, "updated_at" = ? WHERE "voters"."id" = 9  [["password", ""], ["approved", true], ["updated_at", Thu, 24 Oct 2013 12:28:57 UTC +00:00]]

  def approve
     @voter = Voter.find(params[:id])
     @voter.approved = true
     @voter.save!
---
SELECT "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "voters" SET "approved" = ?, "updated_at" = ? WHERE "voters"."id" = 14  [["approved", true], ["updated_at", Thu, 24 Oct 2013 14:44:51 UTC +00:00]]

  def destroy
    @voter.destroy
---
DELETE FROM "voters" WHERE "voters"."id" = ?  [["id", 3]]

    def set_voter
      @voter = Voter.find(params[:id])
---
SELECT "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", "6"]]